[
  {
    "User Input": "I've been in the library for 10 hours and I still don't get this chapter.",
    "AI Response": "It sounds like you've reached your limit for today. Deep learning happens best when the mind is rested."
  },
  {
    "User Input": "If I fail this mid-sem, my parents are going to be so disappointed.",
    "AI Response": "That's a heavy burden to carry. Your value is more than your academic performance."
  },
  {
    "User Input": "Everyone else is finishing their projects and I haven't even started.",
    "AI Response": "Comparison can be so draining. You're on your own timeline, and that's okay."
  },
  {
    "User Input": "My brain feels like it's melting. I can't look at another screen.",
    "AI Response": "When the 'mental fog' sets in, it's usually a signal that your brain needs a break."
  },
  {
    "User Input": "I'm so behind on my syllabus that I just want to give up.",
    "AI Response": "Starting is often the hardest part. What if we just look at the first page together?"
  },
  {
    "User Input": "I haven't slept more than 3 hours this week because of this lab report.",
    "AI Response": "Sleep is a fundamental need, not a luxury. Productivity drops when we are this tired."
  },
  {
    "User Input": "I used to be a topper, but here I'm just struggling to pass.",
    "AI Response": "The transition to university-level work is tough for everyone. You aren't 'less' for struggling."
  },
  {
    "User Input": "The math problems are just blurred lines on the page now. I'm so tired.",
    "AI Response": "It's hard to solve problems when you're exhausted. Maybe some water and a short walk first?"
  },
  {
    "User Input": "I have three exams in two days. I don't think I can do this.",
    "AI Response": "That's an intense schedule. Let's focus on just the next hour, not the next two days."
  },
  {
    "User Input": "I messed up the presentation. Everyone saw me shaking.",
    "AI Response": "People usually focus on the content, not the nerves. It’s brave that you finished it."
  },
  {
    "User Input": "I can't concentrate. Every time I sit down, I just stare at the wall.",
    "AI Response": "Staring at the wall is often a sign of burnout. It’s okay to step away for a while."
  },
  {
    "User Input": "I'm terrified of the placement season. What if nobody hires me?",
    "AI Response": "Future anxiety is real, but you're building skills every day, even when it doesn't feel like it."
  },
  {
    "User Input": "I hate this degree. I only took it because of the pressure.",
    "AI Response": "It’s hard to study something that doesn't feel like 'you'. How can we find a small spark today?"
  },
  {
    "User Input": "I'm paying so much for this course and I'm learning nothing.",
    "AI Response": "Educational pressure is stressful. You’re doing your best with what you have."
  },
  {
    "User Input": "My professor said my work was 'subpar'. It hurts so much.",
    "AI Response": "One piece of feedback doesn't define your entire capability. Take what's useful, leave the rest."
  },
  {
    "User Input": "I feel like a machine that's about to break down.",
    "AI Response": "You aren't a machine; you're a human who needs care. What’s one thing you can do for 'you' right now?"
  },
  {
    "User Input": "I missed the submission deadline by 2 minutes. I'm ruined.",
    "AI Response": "Most professors are human too. It’s worth reaching out and explaining the situation."
  },
  {
    "User Input": "I'm working a part-time job and studying. I have zero time for myself.",
    "AI Response": "Balancing both is an incredible feat of strength, but even the strongest need to rest."
  },
  {
    "User Input": "My friends are all getting internships. I'm just getting rejections.",
    "AI Response": "Rejections are just redirections. Your 'yes' is coming, even if the wait feels long."
  },
  {
    "User Input": "I want to drop out, but I'm too scared of what people will say.",
    "AI Response": "That’s a big, heavy thought. It’s okay to feel lost sometimes while you figure things out."
  },
  {
    "User Input": "I spent the whole weekend in my room and didn't speak to a single person.",
    "AI Response": "Weekends can be hard when the routine stops. It’s okay to have quiet time, but I’m here now."
  },
  {
    "User Input": "I see everyone posting pictures of their hangouts and I'm never invited.",
    "AI Response": "Social media only shows the highlights, not the lonely moments everyone has."
  },
  {
    "User Input": "I want to make friends, but I don't know how to start a conversation.",
    "AI Response": "Socializing is a skill that takes practice. Even a small 'hello' is a victory."
  },
  {
    "User Input": "I feel like everyone is judging the way I walk or talk.",
    "AI Response": "We are often our own harshest critics. Most people are busy thinking about themselves."
  },
  {
    "User Input": "I sat alone in the canteen again today. I feel so pathetic.",
    "AI Response": "Eating alone is actually quite common, but the feeling of 'pathetic' is tough to sit with."
  },
  {
    "User Input": "My roommates are always whispering when I enter the room.",
    "AI Response": "That sounds like an incredibly uncomfortable environment. Your home should be a safe space."
  },
  {
    "User Input": "I joined a club but I'm too scared to go to the meetings.",
    "AI Response": "The first step is always the scariest. Maybe you could just stand near the door next time?"
  },
  {
    "User Input": "I haven't called my parents in weeks because I don't want them to worry.",
    "AI Response": "They likely miss you and would want to support you. Connection helps ease the burden."
  },
  {
    "User Input": "I feel like a ghost in this university. Nobody would notice if I left.",
    "AI Response": "You aren't a ghost. You have a unique place here, even if it feels invisible right now."
  },
  {
    "User Input": "I said something stupid in class and now I can't stop replaying it.",
    "AI Response": "We all have 'cringe' moments. In a week, most people will have forgotten."
  },
  {
    "User Input": "I'm terrified of group projects because I don't want to let people down.",
    "AI Response": "It's okay to be nervous about groups. Your perspective is just as valid as theirs."
  },
  {
    "User Input": "Everyone else has found 'their people' and I'm still alone.",
    "AI Response": "It takes time to find the right tribe. It's not a race, though it feels like one."
  },
  {
    "User Input": "I'm so lonely it actually hurts in my chest.",
    "AI Response": "That physical ache of loneliness is very real. I'm glad you're sharing that with me."
  },
  {
    "User Input": "I keep making excuses to not go out because I'm afraid of being awkward.",
    "AI Response": "Avoiding things feels safe, but it also keeps us isolated. What's one low-stakes outing?"
  },
  {
    "User Input": "I feel like I'm wearing a mask every time I leave my room.",
    "AI Response": "Maintaining a 'mask' is exhausting. It's okay to not be 'on' all the time."
  },
  {
    "User Input": "Nobody ever texts me first. It makes me feel worthless.",
    "AI Response": "Initiating is hard for many people. It often isn't about your worth at all."
  },
  {
    "User Input": "I miss my home friends so much. Here, everything feels cold.",
    "AI Response": "Homesickness is a sign of how much you value those connections. It's okay to grieve them."
  },
  {
    "User Input": "I don't belong here. I'm just a misfit.",
    "AI Response": "A 'misfit' often just means you haven't found your specific niche yet. It exists."
  },
  {
    "User Input": "I'm jealous of people who can just talk to anyone so easily.",
    "AI Response": "Extroversion is just one way to be. Your quietness has its own quiet strength."
  },
  {
    "User Input": "I feel like I'm annoying everyone I talk to.",
    "AI Response": "Anxiety often tells us lies about being 'annoying'. You have a right to take up space."
  },
  {
    "User Input": "I can't stop thinking about what might go wrong tomorrow.",
    "AI Response": "Thinking ahead can feel like a safety measure, but it’s exhausting. Let’s focus on right now."
  },
  {
    "User Input": "My heart starts racing every time my phone pings.",
    "AI Response": "That sounds like a lot of physical tension. Would you like to try a quick grounding exercise?"
  },
  {
    "User Input": "I feel like I'm constantly waiting for something bad to happen.",
    "AI Response": "Living in 'high alert' is draining. You're safe in this moment."
  },
  {
    "User Input": "I keep checking my emails every five minutes.",
    "AI Response": "The cycle of checking is tough to break. What if we try to wait ten minutes before the next check?"
  },
  {
    "User Input": "I'm worried I'm not doing enough, even when I'm working.",
    "AI Response": "The feeling of 'never enough' is a heavy one. You are allowed to have limits."
  },
  {
    "User Input": "I get so anxious in the mornings I can barely eat.",
    "AI Response": "Morning anxiety is a physical challenge. Maybe a small sip of water or tea first?"
  },
  {
    "User Input": "I'm spiraling again. Everything feels like it's crashing down.",
    "AI Response": "Spirals feel overwhelming, but they do have an end. Let's find one solid thing to hold onto."
  },
  {
    "User Input": "I keep thinking about a mistake I made three years ago.",
    "AI Response": "The past can be a loud visitor. It doesn't define who you are today."
  },
  {
    "User Input": "I feel like I'm failing at life.",
    "AI Response": "That's a very big thought. Can we look at one small thing that went okay today?"
  },
  {
    "User Input": "I'm so tired of being anxious all the time.",
    "AI Response": "It is exhausting to be on edge. I'm here to listen whenever it feels too much."
  },
  {
    "User Input": "I feel like I have no control over my thoughts.",
    "AI Response": "Thoughts can feel like a wild river. You don't have to jump in; you can just watch them pass."
  },
  {
    "User Input": "What if I never figure things out?",
    "AI Response": "The 'what if' questions are endless. It's okay to not have the answers yet."
  },
  {
    "User Input": "I feel like I'm just faking being okay.",
    "AI Response": "Wearing a brave face is hard work. It's safe to be honest here."
  },
  {
    "User Input": "I'm terrified of making the wrong decision.",
    "AI Response": "Decisions are rarely final. Most paths have turns and ways back."
  },
  {
    "User Input": "I can't sleep because my mind won't shut up.",
    "AI Response": "A busy mind at night is difficult. Sometimes writing those thoughts down helps get them 'out'."
  },
  {
    "User Input": "I feel like I'm constantly on the verge of crying.",
    "AI Response": "Suppressed emotions need a release. It's okay to let those tears out."
  },
  {
    "User Input": "I'm overwhelmed by the news and everything happening in the world.",
    "AI Response": "The weight of the world is too much for one person. It's okay to disconnect for a bit."
  },
  {
    "User Input": "I feel like I'm losing my mind.",
    "AI Response": "That's a scary feeling. You're not alone, and we can take this one breath at a time."
  },
  {
    "User Input": "I'm so restless but I have no energy to do anything.",
    "AI Response": "That 'tired but wired' feeling is tough. Maybe just a small stretch would help?"
  },
  {
    "User Input": "I feel like everyone else has it all together.",
    "AI Response": "Most people are just better at hiding the chaos. You're not the only one feeling this way."
  },
  {
    "User Input": "I only got into this college by luck. I don't belong here.",
    "AI Response": "Luck might have opened a door, but your hard work kept you there."
  },
  {
    "User Input": "I'm afraid everyone will find out I'm not as smart as they think.",
    "AI Response": "That's the classic 'imposter' voice. You've earned your seat at the table."
  },
  {
    "User Input": "I feel like a fraud every time I speak in class.",
    "AI Response": "Sharing your thoughts is brave. Your perspective is as valid as anyone else's."
  },
  {
    "User Input": "I'm not as good as the others in my department.",
    "AI Response": "Comparison is the thief of joy. You bring your own unique strengths."
  },
  {
    "User Input": "I feel like I have to work twice as hard to stay at the same level.",
    "AI Response": "That's a lot of extra effort. Make sure you're also making space for rest."
  },
  {
    "User Input": "I'm waiting for the moment I fail and everyone sees it.",
    "AI Response": "The fear of failure is common, but it doesn't mean failure is inevitable."
  },
  {
    "User Input": "I feel like I don't deserve the praise I get.",
    "AI Response": "If people are praising you, it's because they see value in your work. Try to believe them."
  },
  {
    "User Input": "I'm just a 'token' here; I'm not actually talented.",
    "AI Response": "You are here because of your capability. Don't let doubt minimize your achievements."
  },
  {
    "User Input": "I feel like I'm just getting by while everyone else is thriving.",
    "AI Response": "Thriving looks different for everyone. Surviving a hard day is a win, too."
  },
  {
    "User Input": "I'm so scared of being criticized.",
    "AI Response": "Criticism is just feedback on a task, not a judgment of your person."
  },
  {
    "User Input": "I feel like I have to be perfect at everything.",
    "AI Response": "Perfection is an impossible standard. Excellence is about growth, not being flawless."
  },
  {
    "User Input": "I'm afraid to try new things because I might fail.",
    "AI Response": "Failure is just a part of learning. Every expert was once a beginner."
  },
  {
    "User Input": "I feel like I'm not 'enough'.",
    "AI Response": "You are enough exactly as you are. Your worth isn't tied to your output."
  },
  {
    "User Input": "I'm so self-conscious about my work.",
    "AI Response": "Being careful is good, but don't let it stop you from sharing your voice."
  },
  {
    "User Input": "I feel like I'm a disappointment to everyone.",
    "AI Response": "That's a heavy burden. Most people are far more focused on their own lives than on judging yours."
  },
  {
    "User Input": "I'm my own worst enemy.",
    "AI Response": "It's hard when the voice in your head is mean. Can we try to speak to ourselves like we would a friend?"
  },
  {
    "User Input": "I feel like I'm constantly falling behind.",
    "AI Response": "Life isn't a race. You're moving at the pace that's right for you."
  },
  {
    "User Input": "I'm afraid to ask for help because I don't want to look weak.",
    "AI Response": "Asking for help is actually a sign of strength and self-awareness."
  },
  {
    "User Input": "I feel like I'm just a burden to everyone around me.",
    "AI Response": "You are not a burden. Your friends and family care about you and want to be there."
  },
  {
    "User Input": "I'm so tired of feeling like I'm not good enough.",
    "AI Response": "That's an exhausting way to live. You deserve to feel confident in yourself."
  },
  {
    "User Input": "I have no idea what I want to do with my life.",
    "AI Response": "It's perfectly okay to still be figuring it out. Many people are."
  },
  {
    "User Input": "I'm terrified of graduating and not finding a job.",
    "AI Response": "Transition periods are scary. Let's look at one small step you can take today."
  },
  {
    "User Input": "I feel like I'm wasting my time on this degree.",
    "AI Response": "If you're learning about yourself, it's not wasted time. What's one thing you *have* enjoyed?"
  },
  {
    "User Input": "I'm worried I'll never be able to afford a house or a family.",
    "AI Response": "Thinking that far ahead is overwhelming. Let's bring it back to your needs for this week."
  },
  {
    "User Input": "I feel like the world is ending and there's no point in trying.",
    "AI Response": "The big picture is heavy. Focusing on small, local acts of kindness can help."
  },
  {
    "User Input": "I'm so stressed about money.",
    "AI Response": "Financial stress is incredibly taxing. Are there any resources or support systems we can look into?"
  },
  {
    "User Input": "I feel like I'm stuck in a rut.",
    "AI Response": "Being stuck is a sign that something needs to change. What's one tiny thing we can shift?"
  },
  {
    "User Input": "I'm afraid I'll never find someone who truly understands me.",
    "AI Response": "Connection takes time and vulnerability. You're worthy of being understood."
  },
  {
    "User Input": "I feel like I'm just going through the motions.",
    "AI Response": "Living on autopilot is a sign of burnout. What's something that makes you feel alive?"
  },
  {
    "User Input": "I'm so tired of the grind.",
    "AI Response": "The 'grind' culture is real and exhausting. You deserve rest and joy, not just productivity."
  },
  {
    "User Input": "I feel like I've lost my passion for everything.",
    "AI Response": "Passion ebbs and flows. It's okay to just 'be' for a while until it returns."
  },
  {
    "User Input": "I'm worried I'm making all the wrong choices.",
    "AI Response": "There are no 'wrong' choices, only different paths with different lessons."
  },
  {
    "User Input": "I feel like I'm running out of time.",
    "AI Response": "Time is not a limited resource for your growth. You have plenty of it."
  },
  {
    "User Input": "I'm afraid of getting older.",
    "AI Response": "Aging is just another form of growing. Each stage of life has its own beauty."
  },
  {
    "User Input": "I feel like I'm not living up to my potential.",
    "AI Response": "Potential isn't a destination. It's something you explore every day."
  },
  {
    "User Input": "I'm so overwhelmed by all the options.",
    "AI Response": "Choice paralysis is real. Let's just pick one small thing to focus on for now."
  },
  {
    "User Input": "I feel like I'm just a small cog in a big machine.",
    "AI Response": "You are a unique individual with an impact on the people around you."
  },
  {
    "User Input": "I'm afraid of the unknown.",
    "AI Response": "The unknown is where all the possibilities live. It's okay to be a little scared."
  },
  {
    "User Input": "I feel like I'm losing my sense of self.",
    "AI Response": "Losing yourself is often the first step to finding a new, stronger version of you."
  },
  {
    "User Input": "I'm just... so tired.",
    "AI Response": "I hear you. You've been carrying a lot. It's okay to just rest right now."
  }
]